package koreait.day02;

// 변수 variable
public class C05_IntegerVar {

	public static void main(String[] args) {  			//main 메소드 시작
		/* 1. main 메소드 안에서만 사용하는 지역변수를 선언합니다.
		 * 2. 기본형 (primitive) 데이터 타입 : 
 		 * 		정수형식 	byte, short, int, long 키워드(역할이 정해진 단어)
		 */
		
		byte n1; 	 //byte 형식의 데이터를 저장할 공간. 이름은 n1
		short n2; 
		int n3;
		long n4;
		
		
		// 변수를 선언하면서 초기값도 주었습니다.
		byte m1= 100;
		short m2=100; //노랑색 밑 줄이 나오는 이유는 값을 줘놓고 사용을 안해서임
		int m3=100;
		long m4=100;
		
		int currentNo; // 변수명은 실제 저장되는 값이 파악되는 단어로 만든다.
		
		
//		System.out.println(n1); // 오류 : 값이 없어서 오류가 남. 초기값이 없으니까
		System.out.println(m1);
		
		
		// 값의 대입(=를 씀)
		n1 = 123;	// 대입문 : 오른쪽 값/수식/변수 가 왼쪽 변수로 대입. 
					// 123은 4바이트 리터럴. byte와 short 은 별도 리터럴 표기 방식이 없다.
					// 자동으로 값이 넘치지 않으면 1바이트 또는 2바이트로 크기가 바뀌어 저장해 준다.
		n1=99;
	//	n1=999; 	//오류 : +127보다 큰 값이라 오류나는거임
		n2=29999; 	
	//	n2=-40000; 	//오류 : -32768보다 작은 값이라 오류
		n3= 123456789;
	//	n3=1234567890123; 	//오류 : 2147483647보다 큰 값이라
	//	n4=1234567890123; 	//오류 : 1234567890123 리터럴은 int 리터럴이라 표현 범위 오류가 남
		n4=123;				// 오류가 안나는 이유는 int 리터럴로 표현가능 한 범위라 그렇다
		n4=1234567890123L; 	// long 형식 리터럴 표시는 : L또는 l 을 마지막에 넣는다
		
		System.out.println("변수 n1 = " + n1);
		System.out.println("변수 n2 = " + n2);
		System.out.printf("변수 %s = %d \n" , "n3 " ,n3);
		System.out.printf("변수 %s = %d \n" , "n4 " ,n4);
		
		
	} // main 메소드 끝

}

/*변수 : 메모리에 저장된 값 중에서 변경할 수 있는 데이터를 말합니다.
 *    변수는 프로그램이 실행되는 동안에 임시로 사용하는 메모리 공간입니다.
 *	    데이터가 저장된 메모리에 접근하기 위해서 변수명(식별자-중복이름은 사용 안됨)을 부여합니다.
 *    변수 선언한다 (변수명과 데이터 형식을 지정하는 것) -> 메모리에 공간 할당 됩니다.
 *    조사할 내용 : 변수명 규칙
 */
